/**
 * @ClassName 问题A公平
 * @Description 题目描述
 * 民国年间，花钱捐得县长的马邦德携妻及随从走马上任。途经南国某地，遭劫匪张麻子一伙伏击，随从尽死，只夫妻二人侥幸活命。马为保命，谎称自己是县长的汤师爷。为汤师爷许下的财富所动，张麻子摇身一变化身县长，带着手下赶赴鹅城上任。有道是天高皇帝远，鹅城地处偏僻，一方霸主黄四郎只手遮天，全然不将这个新来的县长放在眼里。
 * 张麻子为了选拔优秀计算机鹅郎，举办了第一届鹅城程序设计竞赛。
 * 为了比赛的公平公正，张麻子立下了一个规矩，凡是在比赛中作弊者，禁赛x年！
 * 现在有T场比赛，每场n道题，每道题状态分为如下几种
 * 1.search: 抄袭他人代码，禁赛4年
 * 2.spread: 将自己的代码传播给其他人，禁赛2年
 * 3.self: 自己写的代码，没有惩罚
 * 每道题的禁赛年数会累加，请输出每场比赛的禁赛年数
 *
 * 输入
 * 第一行一个整数T(1<=T<=100)，表示数据组数
 * 每组数据第一行一个整数n(1<=n<=100000)表示题目数量，接下来n行，每行一个字符串表示每道题的状态，题目保证字符串仅包含以上三种。
 * 输出
 * 每组数据输出一行，表示总的禁赛年数
 *
 * 样例输入 Copy
 * 1
 * 5
 * search
 * spread
 * self
 * search
 * spread
 * 样例输出 Copy
 * 12
 *
 * @Author Bruce
 * @Date 2020/11/14 8:11 下午
 */
public class 问题A公平 {

}
